Tekla Open API Reference for Tekla Structures 2025
ImageList Class
 The ImageList class contains a list of ImageItems.
Inheritance Hierarchy
System.Object
 System.Collections.Generic.List<ImageItem>
 Tekla.Structures.Dialog.UIControls.ImageList
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ImageList : List<ImageItem>
<SerializableAttribute>
Public Class ImageList
	Inherits List(Of ImageItem)
The ImageList type exposes the following members.
Constructors
Name | Description
ImageList
Initializes a new instance of the ImageList class
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace